Revit 2026 API
WireMaterialTypeSet Methods
The WireMaterialTypeSet type exposes the following members.
Methods
Name | Description
Clear | Removes every wire material type from the set, rendering it empty.
Contains | Tests for the existence of a wire material type within the set.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Erase | Removes a specified wire material type from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Insert | Insert the specified wire material type into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
WireMaterialTypeSet Class
Autodesk.Revit.DB.Electrical Namespace